In [1]:
import pandas as pd

In [2]:
#read_csv 로 파일 불러오기 (동일 디렉토리)
movies = pd.read_csv('movies.csv' , index_col="Title") #index_col : Ttitle로 정하기 (기본: 숫자)

In [3]:
print(type(movies))

<class 'pandas.core.frame.DataFrame'>

In [4]:
movies.head(4)

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

In [5]:
movies.tail(6)

                          Rank           Studio     Gross  Year
Title
21 Jump Street             777             Sony  $201.60   2012
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [6]:
movies.shape

(782, 4)

In [7]:
#총 셀의 갯수 
movies.size

3128

In [8]:
movies["Studio"].value_counts().head(10)

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
MGM                 11
Name: count, dtype: int64

In [10]:
#Universial 에서 릴리즈한 목록 뽑기 
movies[movies["Studio"]=="Universal"]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [14]:
#Universial 에서 릴리즈한 목록 을 변수에 담아 보관 하자 
released_by_universal = movies["Studio"] == "Universal" #select 조건 
movies[released_by_universal] #조건 대입

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

두가지 조건을 "또한"으로 합쳐 목록을 뽑아보자 <BR>
Universal에서 만들었고 또한 2015년에 제작된 영화만 뽑아보자 <br>
### 데이터 검색 필터링 하기

In [16]:
#두가지 조건의 변수를 만든다. 
releasedByUniversal = movies["Studio"] == "Universal"
releasedIn2015 = movies["Year"] == 2015

In [17]:
#두가지 조건을 & (또한)으로 묶는다. 
movies[releasedByUniversal & releasedIn2015]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [18]:
movies[releasedByUniversal | releasedIn2015]

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

140개 목록이 검색 되었다 <br>

### 1975년이전 개봉영화

In [19]:
#검색 조건 
before1975 = movies["Year"] < 1975

In [20]:
movies[before1975]

                    Rank           Studio     Gross  Year
Title
The Exorcist         252  Warner Brothers  $441.30   1973
Gone with the Wind   288              MGM  $402.40   1939
Bambi                540              RKO  $267.40   1942
The Godfather        604        Paramount  $245.10   1972
101 Dalmatians       708      Buena Vista  $215.90   1961
The Jungle Book      755      Buena Vista  $205.80   1967

### between() 함수 이용하기

In [25]:
#검색조건 
mid_80s = movies['Year'].between(1983,1986) # 80년대 중반 (1983~1986)년간 개봉한 영화 검색

In [26]:
movies[mid_80s]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

In [33]:
#영화 제목(index)만 뽑아낸것  782개 
title = movies.index.str

In [34]:
print(title)

<pandas.core.strings.accessor.StringMethods object at 0x1681ac610>

In [35]:
#전부 소문자화 한다음  'dark'단어가 들어간 index만뽑아 내자 
#index.
hasDarkInTitle = movies.index.str.lower().str.contains('dark')

In [36]:
movies[hasDarkInTitle]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

## 1.3.5 데이터 그룹화

movies['Gross'].str.replace("$", "", regex = False).str.replace(",","", reget = False)

In [38]:
movies['Gross'] = ( movies['Gross']
                   .str.replace("$", "" , regex = False)
                   .str.replace(",", "", regex = False)
                   .astype(float)
                  )

In [39]:
movies['Gross'].mean()

439.0308184143222

#### Groupby() 
#열의 값을 기반으로 DataFrame의 행을 그룹화 하자

In [40]:
studios = movies.groupby('Studio') # 먼저 groupby로 스튜디오기준으로 묶은다음 변수에 저장

In [46]:
studios["Gross"].count() # 그룹별"Grsss" count 는 영화사 그룹별 수량(Count)을 세는 것이지 Gross의 값을 더하는것이 아니다.

Studio
Artisan                     1
Buena Vista               125
CL                          1
China Film Corporation      1
Columbia                    5
Dimension                   2
Dreamworks                 27
FR                          1
FUN                         1
Focus                       1
Fox                       117
GrtIndia                    1
HC                          1
IFC                         1
Lions                       1
Lionsgate                  21
MGM                        11
Magn.                       1
Miramax                    10
New Line                   16
Newmarket                   1
Orion                       2
Paramount                  76
Pathe                       1
Polygram                    2
RKO                         1
Rela.                       1
SonR                        2
Sony                       86
TriStar                    11
USA                         1
UTV                         1
Universal                 109
Vestron                     1
WGUSA                       4
Warner Brothers           132
Weinstein                   6
Name: Gross, dtype: int64

In [50]:
# sort_values
#영화별 제작수로  정렬 
studios["Gross"].count().sort_values(ascending=False)

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
TriStar                    11
MGM                        11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Orion                       2
Dimension                   2
Polygram                    2
SonR                        2
IFC                         1
Rela.                       1
CL                          1
Vestron                     1
China Film Corporation      1
UTV                         1
USA                         1
RKO                         1
Lions                       1
Pathe                       1
FR                          1
Newmarket                   1
FUN                         1
Focus                       1
Magn.                       1
GrtIndia                    1
HC                          1
Artisan                     1
Name: Gross, dtype: int64

In [57]:
# Gross에 총합(Sum)을 세고 그값에 큰순으로 정렬 할경우 
studios['Gross'].sum().sort_values(ascending=False)

Studio
Buena Vista               73585.0
Warner Brothers           58643.8
Fox                       50420.8
Universal                 44302.3
Sony                      32822.5
Paramount                 32486.0
Dreamworks                12260.4
Lionsgate                 10033.2
New Line                   6584.8
MGM                        3513.1
TriStar                    3185.5
Miramax                    2480.6
Weinstein                  2057.7
WGUSA                      1349.1
Columbia                   1276.6
HC                          870.3
China Film Corporation      699.8
Orion                       696.9
Newmarket                   611.9
SonR                        515.1
Polygram                    496.9
Dimension                   488.7
FR                          385.3
IFC                         368.7
FUN                         358.0
UTV                         302.9
RKO                         267.4
GrtIndia                    254.2
Artisan                     248.6
Pathe                       245.1
CL                          228.1
Rela.                       226.9
Lions                       222.4
Vestron                     214.6
USA                         207.5
Focus                       205.8
Magn.                       205.6
Name: Gross, dtype: float64